// Задача 25 Вывести на экран кубы чисел от 1 до N

int n = 5;

for(int i = 1; i <= n; i++){
    Console.WriteLine(Math.Pow(i, 3));
}